---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofCutoffRemoved
source: html/4098ccb1-8319-2ca9-ce95-923220efa736.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.RoofCutoffRemoved Property

The roof's cutoff failed and was removed; make sure the cutoff height is not below the roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoofCutoffRemoved { get; }
```